---
title: RailingType
classe: Autodesk.Revit.DB.Architecture.RailingType
namespace: Autodesk.Revit.DB.Architecture
eredita: Autodesk.Revit.DB.ElementType
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 12
---

# RailingType

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `BalusterPlacement BalusterPlacement { get; }` | `railingType.BalusterPlacement` | BalusterPlacement |
| `Double PrimaryHandrailHeight { get; }` | `railingType.PrimaryHandrailHeight` | Double |
| `Double PrimaryHandrailLateralOffset { get; }` | `railingType.PrimaryHandrailLateralOffset` | Double |
| `HandRailPosition PrimaryHandRailPosition { get; set; }` | `railingType.PrimaryHandRailPosition` | HandRailPosition |
| `ElementId PrimaryHandrailType { get; set; }` | `railingType.PrimaryHandrailType` | ElementId |
| `NonContinuousRailStructure RailStructure { get; }` | `railingType.RailStructure` | NonContinuousRailStructure |
| `Double SecondaryHandrailHeight { get; }` | `railingType.SecondaryHandrailHeight` | Double |
| `Double SecondaryHandrailLateralOffset { get; }` | `railingType.SecondaryHandrailLateralOffset` | Double |
| `HandRailPosition SecondaryHandRailPosition { get; set; }` | `railingType.SecondaryHandRailPosition` | HandRailPosition |
| `ElementId SecondaryHandrailType { get; set; }` | `railingType.SecondaryHandrailType` | ElementId |
| `Double TopRailHeight { get; set; }` | `railingType.TopRailHeight` | Double |
| `ElementId TopRailType { get; set; }` | `railingType.TopRailType` | ElementId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```